Repository: KelvinShadewing/hexoshi
Catalog: data/locale/*.po
Languages: eo, es, fr, pl

source: Output version information and exit.
eo: Montri programversion kaj eliri.
es: Informa de la versión y finaliza.

source: Print errors directly to stdout rather than saving them in a file.
eo: Printi erarojn direkte al stdout anstataŭ savi ilin en dosiero.
es: Muestra los errores en la salida estándar en vez de guardarlos en un archivo.
fr: Afficher les erreurs directement dans stdout plutôt que de les sauvegarder dans un fichier.
pl: Wypisuj błędy prosto do stdout zamiast zapisywania ich w pliku.

source: Manually choose a different language to use.
eo: Permane elekti alian lingvon por uzi ĝin.
es: Elige manualmente un idioma diferente.
fr: Choisissez manuellement une autre langue.
pl: Ręcznie wybierz inny język do użytku.

source: Disable delta timing. Causes the game to slow down when it can't run at full speed instead of becoming choppier.
eo: Malŝalti delto-timadon. Kaŭzas, ke la ludo malrapidiĝas, kiam ĝi ne povas plenumi plene rapide anstataŭ aĝi intermita.
es: Desactiva la sincronización delta. Hace que el juego reduzca su velocidad cuando no puede correr a toda velocidad en lugar de ir a trompicones.
fr: Désactivez-le Delta timing. Ralentie le jeu lorsqu'il ne peut pas fonctionner pleinementPlutôt que de laguer.
pl: Wyłącz synchronizacje czasu. To sprawia ze czas w grze upływa wolniej zamiast skakać gdy gra nie może działać na pełnych obrotach.

source: Where to load the game data from (Default: "{}")
eo: El kie ŝargi la ludajn datumojn (Defaŭlta: "{}")
es: Desde dónde se cargan los datos del juego (Por defecto: "{}")
fr: Ou charger les données du jeu (Défault: "{}")
pl: Skąd ładować dane gry (Domyślnie: "{}")

source: The scale factor to use by default in windowed mode (Default: "{}")
eo: La skala faktoro por uzi defaŭlte dum fenestra reĝado (Defaŭlto: "{}")
es: Factor de escala a usar por defecto en el modo de ventana (Por defecto: "{}")
fr: La résolution a utilisé par défaut en mode fenêtré (Défault: "{}")
pl: Współczynnik skalowania obrazu w trybie okienkowym (Domyślnie: "{}")

source: Specify a scale factor to use in fullscreen mode instead of using dynamic scaling. This will cause the screen resolution to change, which may improve performance. For best results, specify this as the target resolution width divided by {w}, or as the target resolution height divided by {h} (whichever is smaller). For example, to target a resolution of 640x480, use {ex}. A scale factor of 1 will always be fastest, but may result in windowboxing.
eo: Specifi skala faktoro por uzi en plena ekrara modo anstataŭ uzi dinamikan skalon. Tiu faros, ke la ekrana resolucio ŝanĝu, kiu povas pliboni rendimenton. Por plej bone rezultojn, specifu tiun kiel la celdistingiva larĝo dividita je {w}, aŭ kiel la celdistingiva alto dividita je {h} (kiu ajn pli malgranda). Ekzemple, por celi 640x480-distingivon, uzi {ex}. Skala faktoro de 1 ĉiam estos la plej rapida, sed ĝi rezultos je "windowboxing".
es: Especifica el factor de escala que usar en el modo de pantalla completa en vez de usar el escalado dinámico. Esto hará que la resolución de pantalla cambie, lo que puede mejorar el rendimiento. Para mejores resultados, especifica esto como la anchura de la resolución de destino dividida por {w}, o como la resolución de destino dividida por {h} (lo que sea menor). Por ejemplo, para obtener una resolución de 640x480, usa {ex}. Un factor de escala de 1 siempre será lo más rápido, pero resultar en una forma de caja de la ventana.

source: Only show solid colors for backgrounds (uses less RAM).
eo: Nur montri opakajn kolorojn por fonoj (uzas malpli ĉefmemoron).
es: Muestra solo colores sólidos en los fondos de pantalla (usa menos RAM)
fr: Affiche seulement les couleurs solid pour le décor (utilise moins de RAM).
pl: Używaj tylko jednolitych kolorów przy rysowaniu tła (używa mniej pamięci RAM).

source: Don't show the player's heads-up display.
eo: Ne montri na la HUD de la ludulo.
es: No mostrar el HUD del jugador.
fr: Ne montre pas au joueur l'affichage tête haute.
pl: Nie pokazuj HUD.

source: Generate the map even if it already exists.
eo: Generi la mapon eĉ se ĝi jam ekzistas.
es: Genera el mapa aunque ya exista.
fr: Générer la carte même si elle existe déjà.
pl: Generuj mapę nawet gdy już istnieje.

source: Save an image of the full map as "map.png".
eo: Konservi imagon de la plena mapo kiel "map.png".
es: Guarda la imagen del mapa completo como "map.png".
fr: Sauvegarder une image complète de la carte avec pour nom "carte.png".
pl: Zapisz obraz całej mapy jako "map.png".

source: Write the AI data to the game data directory instead of the user data directory (for distribution).
eo: Skribi la AI-datenojn en la datenara dosierujo anstataŭ en la dosierujo de uzantaj datenoj (por distribui).
es: Escribe los datos de IA en el directorio de datos del juego en vez de en el directorio de datos del usuario (para distribución).

source: Quit immediately on startup (useful with -m or -s).
eo: Eliri tuj dum startiĝo (utila kun -m aŭ -s).
es: Cerrar inmediatamente al iniciar (útil con -m o -s).

source: Code entry:
eo: Enigi kodon:
es: Código en entrada:

source: Invalid cheat code: {}
eo: Malvalida trompkodo: {}
es: Código de truco inválido: {}

source: An error occurred in a timeline 'setattr' command: {}
eo: Eraro okazis en kronologia 'setattr'-komando: {}
es: Ha ocurrido un error en la instrucción 'setattr' en la línea del tiempo: {}
fr: Une erreur a eu lieu dans une commande 'setattr': {}
pl: Wystąpił błąd przy poleceniu linii czasu 'setattr' {}

source: An error occurred in a timeline 'exec' command: {}
eo: Eraro okazis en kronologia 'exec'-komando: {}
es: Ha ocurrido un error en la instrucción 'exec' en la línea del tiempo: {}
fr: Une erreur a eu lieu dans une commande 'exec': {}
pl: Wystąpił błąd przy poleceniu linii czasu 'exec' {}

source: An error occurred in a timeline 'if' statement: {}
eo: Eraro okazis en kronologia 'if'-komando: {}
es: Ha ocurrido un error en una expresión 'if' en la línea del tiempo: {}
fr: Une erreur a eu lieu dans une commande 'if': {}
pl: Wystąpił błąd przy instrukcji linii czasu 'if' {}

source: An error occurred in a timeline 'while' statement: {}
eo: Eraro okazis en kronologia 'while'-komando: {}
es: Ha ocurrido un error en una expresión 'while' en la línea del tiempo: {}
fr: Une erreur a eu lieu dans une commande 'while': {}
pl: Wystąpił błąd przy instrukcji linii czasu 'while' {}

source: Loading data...
eo: Ŝarĝante datenojn...
es: Cargando datos...
fr: Chargement des données...
pl: Ładowanie danych...

source: Loading "{}"…
eo: Ŝarĝante "{}"…
es: Cargando "{}"...

source: An error occurred when trying to load the level: {}
eo: Eraro okazis dum la peno ŝargi la nivelon: {}
es: A ocurrido un error al cargar el nivel: {}
fr: Une erreur est survenue lors de la tentative de chargement du niveau: {}
pl: Wystąpił błąd podczas ładowania tego poziomu: {}

source: Press the Menu button to skip…
eo: Premu la Menuo-klavon por daŭrigi…
es: Pulsa el botón de Menú para saltar…

source: Cinematic mode enabled
eo: Kina ago ebligita
es: Modo cinemático habilitado
fr: Mode cinématique activer
pl: Tryb filmowy włączony

source: MACGUFFIN This is the end of the demo! Thank you for playing Hexoshi version {}.
eo: Makgufino Ĉi tio estas la fino de la demonstracio! Dankon por ludi Hexoshi, versio {}.
es: MACGUFFIN ¡Esto es el fin de la demo! Gracias por jugar a Hexoshi versión {}.

source: Don't worry; the full game will not end this way. This is just a placeholder until the game is completed. We hope you enjoyed what you have seen so far, and we hope you enjoy the final game when it is finished!
eo: Ne zorgu; la plena ludo ne finos tiamaniere. Ĉi tio estas nur provizora versio ĝis la ludo estas finita. Ni esperas, ke vi ŝatis, kion vi vidis ĝis nun, kaj ni esperas, ke vi ĝoju la finan ludon, kiam ĝi estas finita!
es: No te preocupes; el juego completo no terminará así. Esto es solo una versión provisional hasta que el juego esté terminado. ¡Esperamos que hayas disfrutado lo que has visto hasta ahora y que disfrutes el juego final cuando esté terminado!

source: USELESS OBJECT It doesn't seem to do anything
eo: NEUTILAĴO Ŝajnas, ke ĝi faras nenion
es: OBJETO INÚTIL Parece que no hace nada

source: HEXOSHI ARTIFACT {amt}/{total} ({pct}%) Fire rate increased
eo: HEXOSHI-ARTEFAKTO {amt}/{total} ({pct}%) Pafofteco pliigita
es: ARTEFACTO DE HEXOSHI {amt}/{total} ({pct}%) Frecuencia de disparo aumentada

source: E-TANK Extra energy capacity acquired
eo: ENERGIUJO Kroma energia enhaveco akirita
es: E-TANK Adquirida mayor capacidad de energía
fr: E-TANK Énergie supplémentaire acquise
pl: E-CYSTERNA Dodatkowa pojemność energii nabyta

source: HEX ORB Shoot bullets by pressing "shoot" Collect Hexoshi Artifacts for faster fire rate
eo: HEKSA SFERO Pafu kuglojn premante "pafi" Kolektu Hexoshi-Artifaktojn por pli da pafofteco
es: ORBE HEX Dispara balas pulsando "disparar" Recoge Artefactos de Hexoshi para una mayor frecuencia de disparo

source: HANDHELD MAP See mini-map in HUD See full map by pressing "map" or via pause menu
eo: MANPORTEBLA MAPO Vidu mapeton en HUD Vidu plenan mapon premante "mapo" aŭ per paŭza menuo
es: MAPA DE MANO Ve el minimapa en el HUD Ve el mapa completo pulsando "mapa" o desde el menú de pausa

source: MAP DISK Area map data loaded
eo: MAPA DISKO Map-datenoj de la regiono ŝargitaj
es: DISCO DE MAPA Datos del área del mapa cargados
fr: CARTE DISQUE Zone supplémentaire ajoutait à la carte
pl: DYSK MAPY Dane mapy obszaru załadowane

source: ATOMIC COMPRESSOR To compress: press "down" while crouching, or select with "mode" and then press "shoot" To uncompress: press "up"
eo: ATOMA KUNPREMILO Por kunpremi: premu "malsupren" dum vi kaŭras, aŭ elektu per "reĝimo" kaj poste premu "pafi" Por malkunpreni: premu "supren"
es: COMPRESOR ATÓMICO Para comprimirte: pulsa "abajo" mientras estás agachado o selecciona con "modo" y después pulsa "disparar" Para descomprimirte: pulsa "arriba"

source: MONKEY BOOTS Press "jump" while touching a wall to wall-jump
eo: BOTOJ DE SIMIO Premu "salti" dum vi tuŝas muron por muro-salti
es: BOTAS DE MONO Pulsa "saltar" mientras tocas una pared para saltar contra la pared

source: HEDGEHOG HORMONE Press "shoot" while in the form of a ball to grow spikes
eo: ERINACA HORMONO Premu "pafi" dum en la formo de bulo por kreskigi pikilojn
es: HORMONA DE ERIZO Pulsa "disparar" mientras está en forma de bola para hacer crecer pinchos

source: WARP PAD Progress saved. Press "up" to teleport.
eo: TELEPORTILO Progreso konservita. Premu "supren" por teleportiĝi.
es: TELETRANSPORTADOR Progreso guardado. Pulsa "arriba" para teletransportarte.

source: Credits
eo: Atribuoj
es: Créditos
pl: Autorzy

source: Load Game
eo: Ŝargi Ludon
es: Cargar partida
fr: Charger un Partie
pl: Załaduj Grę

source: New Game
eo: Novan Ludon
es: Nueva Partida
fr: Nouvelle Partie
pl: Nowa Gra

source: Options
eo: Agordoj
es: Opciones
pl: Opcje

source: Quit
eo: Eliri
es: Salir
fr: Quitter
pl: Wyjdź

source: -Empty-
eo: -Malplena-
es: -Vacío-
fr: -Vide-
pl: -Puste-

source: ! Incompatible Save !
eo: ! Nekongrua konservaĵo !
es: ¡ Archivo de guardado incompatible !

source: Back
eo: Reen
es: Atrás
fr: Retour
pl: Wstecz

source: Cancel
eo: Nuligi
es: Cancelar
fr: Annuler
pl: Anuluj

source: Overwrite this save file
eo: Anstataŭigi ĉi tiun dosieron
es: Sobrescribe este archivo de guardado
fr: Écraser cette sauvegarde
pl: Nadpisz ten plik

source: An error occurred when trying to load the game.
eo: Eraro okazis dum la ŝargo de la ludo.
es: A ocurrido un error al intentar cargar la partida.
fr: Une erreur est survenue lors du chargement du jeu.
pl: Wystąpił błąd podczas ładowania gry

source: Fullscreen: {}
eo: Plena ekraro: {}
es: Pantalla completa: {}
fr: Plein Ecran: {}
pl: Pełny Ekran: {}

source: Off
eo: For
es: Desactivado
pl: Nie

source: On
eo: Ek
es: Activado
pl: Tak

source: Scale Method: {}
eo: Skalo-metedo: {}
es: Método de escala: {}
fr: Méthode D'échantillonnage
pl: Metoda Skalowania: {}

source: Sound Volume: {}%
eo: Sona laŭteco: {}
es: Volumen del sonido: {}

source: Music Volume: {}%
eo: Muzika laŭteco: {}
es: Volumen de la música: {}

source: Stereo: {}
eo: Stereofonie: {}
es: Estéreo: {}
pl: Dźwięk Stereo: {}

source: Show FPS: {}
eo: Montri FPS: {}
es: Muestra FPS: {}
fr: Indiquer les FPS: {}
pl: Pokazywanie kl./s: {}

source: Metroid-Style Aiming: {}
eo: Metroid-Maniero por celi: {}
es: Apuntar Estilo Metroid: {}

source: Joystick Threshold: {}%
eo: Stirstanga Sojlo: {}%
es: Sensibilidad de la palanca de mando: {}%
fr: Sensibilité de la manette: {}
pl: Próg Aktywacji Dżojstika: {}%

source: Configure keyboard
eo: Konfiguri klavaron
es: Configurar teclado
fr: Configurer le Clavier
pl: Skonfiguruj klawiaturę

source: Configure joysticks
eo: Konfiguri stirstangojn
es: Configurar joysticks
fr: Configurer la Manette
pl: Skonfiguruj dżojstiki

source: Detect joysticks
eo: Detekti stirtangojn
es: Detectar mandos
fr: Detecter le joystick
pl: Wykrywanie dżojstików

source: Left: {}
eo: Maldekstren: {}
es: Izquierda: {}
fr: Gauche: {}
pl: Lewo: {}

source: Right: {}
eo: Dekstren: {}
es: Derecha: {}
fr: Droite: {}
pl: Prawo: {}

source: Up: {}
eo: Supren: {}
es: Arriba: {}
fr: Haut: {}
pl: Góra: {}

source: Down: {}
eo: Malsupren: {}
es: Abajo: {}
fr: Bas: {}
pl: Dół: {}

source: Jump: {}
eo: Salti: {}
es: Saltar: {}
fr: Saut: {}
pl: Skacz: {}

source: Shoot: {}
eo: Pafi: {}
es: Disparar: {}
fr: Tire: {}
pl: Strzelaj: {}

source: Secondary: {}
eo: Akcesora: {}
es: Secundario: {}

source: Aim Diagonal: {}
eo: Celi Diagonale: {}
es: Apuntar Diagonalmente: {}
fr: Visée Diagonale: {}
pl: Celowanie na Skos: {}

source: Aim Up: {}
eo: Celi supren: {}
es: Apuntar arriba: {}
fr: Visée en Haut: {}
pl: Celowanie w Górę: {}

source: Aim Down: {}
eo: Celi Malsupren: {}
es: Apuntar abajo: {}
fr: Visée en Bas: {}
pl: Celowanie w Dół: {}

source: Pause: {}
eo: Paŭzo: {}
es: Pausar: {}
pl: Pauza: {}

source: Map: {}
eo: Mapo: {}
es: Mapa: {}

source: Press the key you wish to bind to this function, or the Escape key to cancel.
eo: Premu la klavon, kiun vi deziras ligi al ĉi tiu funkcio, aŭ la eskapan klavon por nuligi.
es: Pulsa la tecla que deseas asociar a esta función o la tecla de Escape para cancelar.

source: None
eo: Nenio
es: Ninguna
fr: Aucun
pl: Nic

source: Press the joystick button, axis, or hat direction you wish to bind to this function, or the Escape key to cancel.
eo: Premu la stirstangan butonon, akson aŭ ĉapelan direkton, kiun vi deziras ligi al ĉi tiu funkcio, aŭ la Eskapan klavon por nuligi.
es: Pulsa el botón de la palanca de mando, eje o el botón direccional que deseas asignar a esta función, o la tecla de Escape para cancelar.

source: Continue
eo: Daŭrigi
es: Continuar
fr: Continuer
pl: Kontynuuj

source: View Stats
eo: Vidi Statistikojn
es: Ver Estadísticas

source: View Map
eo: Vidi Mapon
es: Ver Mapa
fr: Voir la Carte
pl: Pokaż Mapę

source: Return to Title Screen
eo: Reveni al Titola Ekrano
es: Volver a la Pantalla de Inicio
fr: Revenir a l'écran de démarage
pl: Powrót do Ekranu Tytułowego

source: Some progress has not been saved. If you leave the game now, this unsaved progress will be lost. You can save the game by touching any warp pad.
eo: Iom da progreso ne estis konservita. Se vi foriras la ludon nun, ĉi tiu malkonservita progreso perdiĝos. Vi povas konservi la ludon premante ajn teleportulon.
es: Parte del progreso no se ha guardado. Si sales del juego ahora, este progreso sin guardar se perderá. Puedes guardar la partida tocando cualquier teletransportador.

source: PLAYER STATISTICS Time spent: {hours}:{minutes:02}:{seconds:02} Powerups collected: {powerups_col} ({powerups_percent}%) Artifacts collected: {artifacts} ({artifacts_percent}%) Total completion: {completion}%
eo: STATISTIKOJ DE LUDULO Tempo uzita: {hours}:{minutes:02}:{seconds:02} Plibonaĵoj kolektitaj: {powerups_col} ({powerups_percent}%) Artefaktoj kolektitaj : {artifacts} ({artifacts_percent}%) Entuta plenumo: {completion}%
es: ESTADÍSTICAS DEL JUGADOR Tiempo invertido: {hours}:{minutes:02}:{seconds:02} Mejoras obtenidas: {powerups_col} ({powerups_percent}%) Objetos obtenidos: {powerups} ({powerups_percent}%) Total completado: {completion}%

source: Abandon unsaved progress
eo: Forlasi malkonservitan progreson
es: Abandona el progreso sin guardar

source: Return to game
eo: Reen al la ludo
es: Volver al juego

source: Generating new map files; this may take some time.
eo: Generata novajn mapdosierojn; tio povas daŭri iom da tempo.
es: Generando nuevos archivos de mapas; esto podría tomar tiempo.
fr: Génération des nouvelles cartes; cela peut prendre du temps.
pl: Generowanie nowych map; to może potrwać trochę czasu.

source: Initializing game system…
eo: Pravalorizante ludan sistemon…
es: Inicializando el sistema del juego…

source: Initializing GUI system…
eo: Pravalorizante grafikan interfacan sistemon…
es: Inicializando el sistema de GUI…

source: Loading resources…
eo: Ŝarĝante resursojn…
es: Cargando recursos…

source: Starting game…
eo: Komencante ludon…
es: Comenzando el juego…

source: Successfully started Hexoshi. Quitting now as -q was passed.
eo: Oni sukcese komencis Hexoshi. Nun eliros, ĉar -q estis premita.
es: Hexoshi iniciado con éxito. Cerrando ahora al haber pasado -q.

source: Loading "{}"...
fr: Chargement "{}"...
pl: Ładowanie "{}"...

source: Press the Menu button to skip...
fr: Appuyer sur la touche Menu pour passer....
pl: Naciśnij przycisk Menu aby pominąć...

source: USELESS ARTIFACT It doesn't seem to do anything
fr: ARTEFACT INUTILE Apparemment, il semble que rien ne se passe
pl: BEZUŻYTECZNY ARTEFAKT Nie wydaje się że cokolwiek robi

source: LIFE ORB Absorb life force from defeated enemies
fr: ORB DE VIE Absorber la force vitale d'un ennemi vaincue
pl: KULA ŻYCIA Absorbuj życie pokonanych wrogów

source: HANDHELD MAP See mini-map in HUD and full map from pause menu
fr: Carte Pratique Voir la mini-map dans le HUD et la carte complète à partir du menu pause
pl: RĘCZNA MAPA Zobacz mini-mapę w HUDzie i pełną mapę z menu pauzy

source: Sound: {}
fr: Son: {}
pl: Dźwięk: {}

source: Music: {}
pl: Muzyka: {}

source: Player {}
fr: Joueur {}
pl: Gracz {}

source: Reset Mode: {}
fr: Mode Reset: {}
pl: Zresetuj Tryb: {}

source: Mode: {}
pl: Tryb: {}

source: Press the key you wish to toggle, or Escape to cancel.
fr: Appuyer sur la touche que vous voulez attribuer, ou appuyer sur la touche échappe pour annuler.
pl: Przyciśnij klawisz który chcesz użyć lub usunąć, lub Esc aby anulować.

source: Press the joystick button, axis, or hat direction you wish to toggle, or the Escape key to cancel.
fr: Appuyer sur les boutons de la manette, axe ou une direction que vous voulez attribuer, ou laTouche Échap pour annuler.
pl: Przyciśnij klawisz dżojstika, oś, lub kierunek kapturka którą chcesz użyć lub usunąć, lub Esc aby anulować.

source: Error
fr: Erreur
pl: Błąd

source: Initializing game system...
fr: Initialisation du jeu...
pl: Inicjowanie systemu gry...

source: Initializing GUI system...
fr: Initialisation de la IGU
pl: Inicjowanie systemu interfejsu graficznego...

source: Loading resources...
fr: Chargement des ressources...
pl: Ładowanie zasobów

source: Starting game...
fr: Démarrage du jeu...
pl: Startowanie gry...
